benchmark/results/qwen_large_load.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: scenarios/load.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 5 looping VUs for 2m0s (gracefulStop: 30s)


running (0m01.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 5 VUs  0m01.0s/2m0s

running (0m02.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 5 VUs  0m02.0s/2m0s

running (0m03.0s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [   2% ] 5 VUs  0m03.0s/2m0s

running (0m04.0s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [   3% ] 5 VUs  0m04.0s/2m0s

running (0m05.0s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [   4% ] 5 VUs  0m05.0s/2m0s

running (0m06.0s), 5/5 VUs, 2 complete and 0 interrupted iterations
default   [   5% ] 5 VUs  0m06.0s/2m0s

running (0m07.0s), 5/5 VUs, 2 complete and 0 interrupted iterations
default   [   6% ] 5 VUs  0m07.0s/2m0s

running (0m08.0s), 5/5 VUs, 2 complete and 0 interrupted iterations
default   [   7% ] 5 VUs  0m08.0s/2m0s

running (0m09.0s), 5/5 VUs, 3 complete and 0 interrupted iterations
default   [   7% ] 5 VUs  0m09.0s/2m0s

running (0m10.0s), 5/5 VUs, 3 complete and 0 interrupted iterations
default   [   8% ] 5 VUs  0m10.0s/2m0s

running (0m11.0s), 5/5 VUs, 3 complete and 0 interrupted iterations
default   [   9% ] 5 VUs  0m11.0s/2m0s

running (0m12.0s), 5/5 VUs, 4 complete and 0 interrupted iterations
default   [  10% ] 5 VUs  0m12.0s/2m0s

running (0m13.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [  11% ] 5 VUs  0m13.0s/2m0s

running (0m14.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [  12% ] 5 VUs  0m14.0s/2m0s

running (0m15.0s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  12% ] 5 VUs  0m15.0s/2m0s

running (0m16.0s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  13% ] 5 VUs  0m16.0s/2m0s

running (0m17.0s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  14% ] 5 VUs  0m17.0s/2m0s

running (0m18.0s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  15% ] 5 VUs  0m18.0s/2m0s

running (0m19.0s), 5/5 VUs, 7 complete and 0 interrupted iterations
default   [  16% ] 5 VUs  0m19.0s/2m0s

running (0m20.0s), 5/5 VUs, 7 complete and 0 interrupted iterations
default   [  17% ] 5 VUs  0m20.0s/2m0s

running (0m21.0s), 5/5 VUs, 8 complete and 0 interrupted iterations
default   [  17% ] 5 VUs  0m21.0s/2m0s

running (0m22.0s), 5/5 VUs, 9 complete and 0 interrupted iterations
default   [  18% ] 5 VUs  0m22.0s/2m0s

running (0m23.0s), 5/5 VUs, 11 complete and 0 interrupted iterations
default   [  19% ] 5 VUs  0m23.0s/2m0s

running (0m24.0s), 5/5 VUs, 11 complete and 0 interrupted iterations
default   [  20% ] 5 VUs  0m24.0s/2m0s

running (0m25.0s), 5/5 VUs, 11 complete and 0 interrupted iterations
default   [  21% ] 5 VUs  0m25.0s/2m0s

running (0m26.0s), 5/5 VUs, 11 complete and 0 interrupted iterations
default   [  22% ] 5 VUs  0m26.0s/2m0s

running (0m27.0s), 5/5 VUs, 12 complete and 0 interrupted iterations
default   [  22% ] 5 VUs  0m27.0s/2m0s

running (0m28.0s), 5/5 VUs, 13 complete and 0 interrupted iterations
default   [  23% ] 5 VUs  0m28.0s/2m0s

running (0m29.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [  24% ] 5 VUs  0m29.0s/2m0s

running (0m30.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [  25% ] 5 VUs  0m30.0s/2m0s

running (0m31.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [  26% ] 5 VUs  0m31.0s/2m0s

running (0m32.0s), 5/5 VUs, 16 complete and 0 interrupted iterations
default   [  27% ] 5 VUs  0m32.0s/2m0s

running (0m33.0s), 5/5 VUs, 16 complete and 0 interrupted iterations
default   [  27% ] 5 VUs  0m33.0s/2m0s

running (0m34.0s), 5/5 VUs, 16 complete and 0 interrupted iterations
default   [  28% ] 5 VUs  0m34.0s/2m0s

running (0m35.0s), 5/5 VUs, 17 complete and 0 interrupted iterations
default   [  29% ] 5 VUs  0m35.0s/2m0s

running (0m36.0s), 5/5 VUs, 17 complete and 0 interrupted iterations
default   [  30% ] 5 VUs  0m36.0s/2m0s

running (0m37.0s), 5/5 VUs, 18 complete and 0 interrupted iterations
default   [  31% ] 5 VUs  0m37.0s/2m0s

running (0m38.0s), 5/5 VUs, 18 complete and 0 interrupted iterations
default   [  32% ] 5 VUs  0m38.0s/2m0s

running (0m39.0s), 5/5 VUs, 19 complete and 0 interrupted iterations
default   [  32% ] 5 VUs  0m39.0s/2m0s

running (0m40.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
default   [  33% ] 5 VUs  0m40.0s/2m0s

running (0m41.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
default   [  34% ] 5 VUs  0m41.0s/2m0s

running (0m42.0s), 5/5 VUs, 21 complete and 0 interrupted iterations
default   [  35% ] 5 VUs  0m42.0s/2m0s

running (0m43.0s), 5/5 VUs, 21 complete and 0 interrupted iterations
default   [  36% ] 5 VUs  0m43.0s/2m0s

running (0m44.0s), 5/5 VUs, 21 complete and 0 interrupted iterations
default   [  37% ] 5 VUs  0m44.0s/2m0s

running (0m45.0s), 5/5 VUs, 23 complete and 0 interrupted iterations
default   [  37% ] 5 VUs  0m45.0s/2m0s

running (0m46.0s), 5/5 VUs, 23 complete and 0 interrupted iterations
default   [  38% ] 5 VUs  0m46.0s/2m0s

running (0m47.0s), 5/5 VUs, 24 complete and 0 interrupted iterations
default   [  39% ] 5 VUs  0m47.0s/2m0s

running (0m48.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
default   [  40% ] 5 VUs  0m48.0s/2m0s

running (0m49.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
default   [  41% ] 5 VUs  0m49.0s/2m0s

running (0m50.0s), 5/5 VUs, 26 complete and 0 interrupted iterations
default   [  42% ] 5 VUs  0m50.0s/2m0s

running (0m51.0s), 5/5 VUs, 26 complete and 0 interrupted iterations
default   [  42% ] 5 VUs  0m51.0s/2m0s

running (0m52.0s), 5/5 VUs, 27 complete and 0 interrupted iterations
default   [  43% ] 5 VUs  0m52.0s/2m0s

running (0m53.0s), 5/5 VUs, 27 complete and 0 interrupted iterations
default   [  44% ] 5 VUs  0m53.0s/2m0s

running (0m54.0s), 5/5 VUs, 28 complete and 0 interrupted iterations
default   [  45% ] 5 VUs  0m54.0s/2m0s

running (0m55.0s), 5/5 VUs, 28 complete and 0 interrupted iterations
default   [  46% ] 5 VUs  0m55.0s/2m0s

running (0m56.0s), 5/5 VUs, 29 complete and 0 interrupted iterations
default   [  47% ] 5 VUs  0m56.0s/2m0s

running (0m57.0s), 5/5 VUs, 29 complete and 0 interrupted iterations
default   [  47% ] 5 VUs  0m57.0s/2m0s

running (0m58.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  48% ] 5 VUs  0m58.0s/2m0s

running (0m59.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  49% ] 5 VUs  0m59.0s/2m0s

running (1m00.0s), 5/5 VUs, 31 complete and 0 interrupted iterations
default   [  50% ] 5 VUs  1m00.0s/2m0s

running (1m01.0s), 5/5 VUs, 31 complete and 0 interrupted iterations
default   [  51% ] 5 VUs  1m01.0s/2m0s

running (1m02.0s), 5/5 VUs, 33 complete and 0 interrupted iterations
default   [  52% ] 5 VUs  1m02.0s/2m0s

running (1m03.0s), 5/5 VUs, 33 complete and 0 interrupted iterations
default   [  52% ] 5 VUs  1m03.0s/2m0s

running (1m04.0s), 5/5 VUs, 34 complete and 0 interrupted iterations
default   [  53% ] 5 VUs  1m04.0s/2m0s

running (1m05.0s), 5/5 VUs, 34 complete and 0 interrupted iterations
default   [  54% ] 5 VUs  1m05.0s/2m0s

running (1m06.0s), 5/5 VUs, 34 complete and 0 interrupted iterations
default   [  55% ] 5 VUs  1m06.0s/2m0s

running (1m07.0s), 5/5 VUs, 34 complete and 0 interrupted iterations
default   [  56% ] 5 VUs  1m07.0s/2m0s

running (1m08.0s), 5/5 VUs, 34 complete and 0 interrupted iterations
default   [  57% ] 5 VUs  1m08.0s/2m0s

running (1m09.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
default   [  57% ] 5 VUs  1m09.0s/2m0s

running (1m10.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
default   [  58% ] 5 VUs  1m10.0s/2m0s

running (1m11.0s), 5/5 VUs, 36 complete and 0 interrupted iterations
default   [  59% ] 5 VUs  1m11.0s/2m0s

running (1m12.0s), 5/5 VUs, 36 complete and 0 interrupted iterations
default   [  60% ] 5 VUs  1m12.0s/2m0s

running (1m13.0s), 5/5 VUs, 37 complete and 0 interrupted iterations
default   [  61% ] 5 VUs  1m13.0s/2m0s

running (1m14.0s), 5/5 VUs, 37 complete and 0 interrupted iterations
default   [  62% ] 5 VUs  1m14.0s/2m0s

running (1m15.0s), 5/5 VUs, 37 complete and 0 interrupted iterations
default   [  62% ] 5 VUs  1m15.0s/2m0s

running (1m16.0s), 5/5 VUs, 37 complete and 0 interrupted iterations
default   [  63% ] 5 VUs  1m16.0s/2m0s

running (1m17.0s), 5/5 VUs, 38 complete and 0 interrupted iterations
default   [  64% ] 5 VUs  1m17.0s/2m0s

running (1m18.0s), 5/5 VUs, 38 complete and 0 interrupted iterations
default   [  65% ] 5 VUs  1m18.0s/2m0s

running (1m19.0s), 5/5 VUs, 38 complete and 0 interrupted iterations
default   [  66% ] 5 VUs  1m19.0s/2m0s

running (1m20.0s), 5/5 VUs, 39 complete and 0 interrupted iterations
default   [  67% ] 5 VUs  1m20.0s/2m0s

running (1m21.0s), 5/5 VUs, 39 complete and 0 interrupted iterations
default   [  67% ] 5 VUs  1m21.0s/2m0s

running (1m22.0s), 5/5 VUs, 40 complete and 0 interrupted iterations
default   [  68% ] 5 VUs  1m22.0s/2m0s

running (1m23.0s), 5/5 VUs, 41 complete and 0 interrupted iterations
default   [  69% ] 5 VUs  1m23.0s/2m0s

running (1m24.0s), 5/5 VUs, 41 complete and 0 interrupted iterations
default   [  70% ] 5 VUs  1m24.0s/2m0s

running (1m25.0s), 5/5 VUs, 43 complete and 0 interrupted iterations
default   [  71% ] 5 VUs  1m25.0s/2m0s

running (1m26.0s), 5/5 VUs, 43 complete and 0 interrupted iterations
default   [  72% ] 5 VUs  1m26.0s/2m0s

running (1m27.0s), 5/5 VUs, 43 complete and 0 interrupted iterations
default   [  72% ] 5 VUs  1m27.0s/2m0s

running (1m28.0s), 5/5 VUs, 44 complete and 0 interrupted iterations
default   [  73% ] 5 VUs  1m28.0s/2m0s

running (1m29.0s), 5/5 VUs, 44 complete and 0 interrupted iterations
default   [  74% ] 5 VUs  1m29.0s/2m0s

running (1m30.0s), 5/5 VUs, 45 complete and 0 interrupted iterations
default   [  75% ] 5 VUs  1m30.0s/2m0s

running (1m31.0s), 5/5 VUs, 45 complete and 0 interrupted iterations
default   [  76% ] 5 VUs  1m31.0s/2m0s

running (1m32.0s), 5/5 VUs, 46 complete and 0 interrupted iterations
default   [  77% ] 5 VUs  1m32.0s/2m0s

running (1m33.0s), 5/5 VUs, 47 complete and 0 interrupted iterations
default   [  77% ] 5 VUs  1m33.0s/2m0s

running (1m34.0s), 5/5 VUs, 47 complete and 0 interrupted iterations
default   [  78% ] 5 VUs  1m34.0s/2m0s

running (1m35.0s), 5/5 VUs, 49 complete and 0 interrupted iterations
default   [  79% ] 5 VUs  1m35.0s/2m0s

running (1m36.0s), 5/5 VUs, 49 complete and 0 interrupted iterations
default   [  80% ] 5 VUs  1m36.0s/2m0s

running (1m37.0s), 5/5 VUs, 50 complete and 0 interrupted iterations
default   [  81% ] 5 VUs  1m37.0s/2m0s

running (1m38.0s), 5/5 VUs, 51 complete and 0 interrupted iterations
default   [  82% ] 5 VUs  1m38.0s/2m0s

running (1m39.0s), 5/5 VUs, 51 complete and 0 interrupted iterations
default   [  82% ] 5 VUs  1m39.0s/2m0s

running (1m40.0s), 5/5 VUs, 51 complete and 0 interrupted iterations
default   [  83% ] 5 VUs  1m40.0s/2m0s

running (1m41.0s), 5/5 VUs, 51 complete and 0 interrupted iterations
default   [  84% ] 5 VUs  1m41.0s/2m0s

running (1m42.0s), 5/5 VUs, 53 complete and 0 interrupted iterations
default   [  85% ] 5 VUs  1m42.0s/2m0s

running (1m43.0s), 5/5 VUs, 53 complete and 0 interrupted iterations
default   [  86% ] 5 VUs  1m43.0s/2m0s

running (1m44.0s), 5/5 VUs, 54 complete and 0 interrupted iterations
default   [  87% ] 5 VUs  1m44.0s/2m0s

running (1m45.0s), 5/5 VUs, 55 complete and 0 interrupted iterations
default   [  87% ] 5 VUs  1m45.0s/2m0s

running (1m46.0s), 5/5 VUs, 56 complete and 0 interrupted iterations
default   [  88% ] 5 VUs  1m46.0s/2m0s

running (1m47.0s), 5/5 VUs, 56 complete and 0 interrupted iterations
default   [  89% ] 5 VUs  1m47.0s/2m0s

running (1m48.0s), 5/5 VUs, 57 complete and 0 interrupted iterations
default   [  90% ] 5 VUs  1m48.0s/2m0s

running (1m49.0s), 5/5 VUs, 58 complete and 0 interrupted iterations
default   [  91% ] 5 VUs  1m49.0s/2m0s

running (1m50.0s), 5/5 VUs, 59 complete and 0 interrupted iterations
default   [  92% ] 5 VUs  1m50.0s/2m0s

running (1m51.0s), 5/5 VUs, 60 complete and 0 interrupted iterations
default   [  92% ] 5 VUs  1m51.0s/2m0s

running (1m52.0s), 5/5 VUs, 60 complete and 0 interrupted iterations
default   [  93% ] 5 VUs  1m52.0s/2m0s

running (1m53.0s), 5/5 VUs, 61 complete and 0 interrupted iterations
default   [  94% ] 5 VUs  1m53.0s/2m0s

running (1m54.0s), 5/5 VUs, 61 complete and 0 interrupted iterations
default   [  95% ] 5 VUs  1m54.0s/2m0s

running (1m55.0s), 5/5 VUs, 63 complete and 0 interrupted iterations
default   [  96% ] 5 VUs  1m55.0s/2m0s

running (1m56.0s), 5/5 VUs, 63 complete and 0 interrupted iterations
default   [  97% ] 5 VUs  1m56.0s/2m0s

running (1m57.0s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  97% ] 5 VUs  1m57.0s/2m0s

running (1m58.0s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  98% ] 5 VUs  1m58.0s/2m0s

running (1m59.0s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  99% ] 5 VUs  1m59.0s/2m0s

running (2m00.0s), 5/5 VUs, 66 complete and 0 interrupted iterations
default   [ 100% ] 5 VUs  2m00.0s/2m0s

running (2m01.0s), 5/5 VUs, 66 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m02.0s), 4/5 VUs, 67 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m03.0s), 4/5 VUs, 67 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m04.0s), 4/5 VUs, 67 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m05.0s), 4/5 VUs, 67 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m06.0s), 4/5 VUs, 67 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m07.0s), 3/5 VUs, 68 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m08.0s), 3/5 VUs, 68 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m09.0s), 2/5 VUs, 69 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m10.0s), 2/5 VUs, 69 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m11.0s), 2/5 VUs, 69 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m12.0s), 2/5 VUs, 69 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m13.0s), 1/5 VUs, 70 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m14.0s), 1/5 VUs, 70 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m15.0s), 1/5 VUs, 70 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m16.0s), 1/5 VUs, 70 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m17.0s), 0/5 VUs, 71 complete and 0 interrupted iterations
default ✓ [ 100% ] 5 VUs  2m0s


  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=8.9s min=1.02s med=8.52s max=21.16s p(90)=17.75s p(95)=19.68s
      { expected_response:true }...: avg=8.9s min=1.02s med=8.52s max=21.16s p(90)=17.75s p(95)=19.68s
    http_req_failed................: 0.00%  0 out of 71
    http_reqs......................: 71     0.518262/s

    EXECUTION
    iteration_duration.............: avg=9.1s min=1.22s med=8.72s max=21.36s p(90)=18s    p(95)=19.9s 
    iterations.....................: 71     0.518262/s
    vus............................: 1      min=1       max=5
    vus_max........................: 5      min=5       max=5

    NETWORK
    data_received..................: 100 kB 726 B/s
    data_sent......................: 50 kB  366 B/s



running (2m17.0s), 0/5 VUs, 71 complete and 0 interrupted iterations
default ✓ [ 100% ] 5 VUs  2m0s